articles/Install-Arch.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Archlinux With Windows7 (hard disk installation media)</title>
<!-- 2016-04-07 Thu 16:58 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="冰糖火箭筒(Junjia Ni)" />
<meta  name="description" content="Install Arch"
 />
<meta  name="keywords" content="linux,arch,archlinux,install,gtk,gnome-terminal,wifi-menu,boot,grub4dos" />
<link rel="stylesheet" type="text/css" href="/static/style.css"><link rel="stylesheet" type="text/css" href="/static/medium-fonts.css">
</head>
<body>
<div id="content">
<h1 class="title">Archlinux With Windows7 (hard disk installation media)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 前言</a></li>
<li><a href="#sec-2">2. Boot</a>
<ul>
<li><a href="#sec-2-1">2.1. Check ISO</a></li>
<li><a href="#sec-2-2">2.2. Install Boot</a></li>
<li><a href="#sec-2-3">2.3. Modify Menu.lst</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Beginners' guide</a>
<ul>
<li><a href="#sec-3-1">3.1. waiting for device</a></li>
<li><a href="#sec-3-2">3.2. wifi-menu</a></li>
<li><a href="#sec-3-3">3.3. gnome-terminal</a></li>
<li><a href="#sec-3-4">3.4. fcitx</a></li>
<li><a href="#sec-3-5">3.5. Swap</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Terminal</a></li>
<li><a href="#sec-5">5. 尾声</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
最近要离职了(2016/04/05正式离职)，公司将收回配置的 <b>Macbook Air</b> 。
</p>

<p>
于是，我无聊得开始安装起 <b>Linux</b> ，选择了好久（选择综合恐惧症），最后选择了 <b>Arch Linux</b> 。
找了好久的 <b>Arch Wiki</b> 都没有找到通过硬盘来安装的方式。于是，我决定自己试试看。
还好，网上有许多的资料可以参考。我结合自己实际操作和资料整理如下：
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Boot</h2>
<div class="outline-text-2" id="text-2">
<p>
安装操作系统，第一步就是要明白引导。这个是起整个操作系统的关键，也是起安装向导的关键。
我是在计算机安装window7的基础来做的。
</p>

<p>
主要需要以下一些工具：
</p>
<ul class="org-ul">
<li>Grub4DOS <a href="http://download.gna.org/grub4dos/">下载地址(gna.org)</a>
</li>
<li>Archlinux ISO <a href="https://www.archlinux.org/download/">下载地址(Offical)</a>
</li>
<li>FCIV <a href="https://www.microsoft.com/en-us/download/details.aspx?id=11533">下载地址(微软文件校验工具)</a>
</li>
</ul>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Check ISO</h3>
<div class="outline-text-3" id="text-2-1">
<p>
首先解压下载下来的微软文件校验工具。解压完成之后校对下载下来的操作系统是否正常。
</p>
<div class="org-src-container">

<pre class="src src-sh">&gt; fciv archlinux-2016.03.01-dual.iso
</pre>
</div>
<p>
这个需要花费一定时间，所以请耐心等待，出来的结果请与 <a href="https://www.archlinux.org/download/">这个页面</a> 的MD5值进行校验。
</p>

<p>
一切检查完毕，可以开始下面的流程了。
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Install Boot</h3>
<div class="outline-text-3" id="text-2-2">
<p>
解压 <b>Grub4DOS</b> ，提取 <b>grldr</b> 、 <b>grldr.mbr</b> 、 <b>menu.lst</b> 这3个文件到 <b>C盘</b> 。
然后我们以 <b>管理员</b> 的身份运行 <code>cmd</code> 。 依次输入以下命令（当然你也可以做成bat可执行脚本文件提高效率）:
</p>

<div class="org-src-container">

<pre class="src src-sh">&gt; bcdedit /export "D:\BCD-Backup" # 将BCD备份到“D:\BCD-Backup”目录
# bcdedit /import "D:\BCD-Backup" # 恢复之前的BCD备份

&gt; bcdedit /create /d "Grub4DOS" /application BOOTSECTOR
# 执行完这步会返回一个 {ID}
&gt; bcdedit /set {ID} device partition=c:
&gt; bcdedit /set {ID} path \grldr.mbr
&gt; bcdedit /displayorder {ID} /addlast
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Modify Menu.lst</h3>
<div class="outline-text-3" id="text-2-3">
<p>
编辑 <b>menu.lst</b> 文件的内容：
</p>
<div class="org-src-container">

<pre class="src src-text">title Archlinux Installer
root (hd0,0)
kernel /vmlinuz archisolabel=archlinux
initrd /archiso.img
boot
</pre>
</div>

<ul class="org-ul">
<li>title 这个类似于描述
</li>
<li>root 指定从哪一个硬盘，哪一个分区开始
</li>
<li>kernel 指定去往哪一个操作系统
</li>
<li>initrd 为Linux格式的启动镜像加载初始的ramdisk，并且在内存中设置合适的参数
</li>
<li>boot 启动
</li>
</ul>

<p>
更多的参数解释可以参考 <a href="https://www.gnu.org/software/grub/manual/legacy/grub.html#kernel">这里</a> 。
</p>

<p>
编辑完成之后保存，如果你不放心可以再次确认一下是否一切正常。随后，重启。
在开机画面先选择 <b>Grub4DOS</b> ，然后选择 <b>Archlinux Installer</b> 。进入安装流程。
</p>

<p>
注意（关于Archlinux操作系统引导）： <br  />
我没有用 <b>Linux</b> 的 <b>Grub</b> 引导来替换 <b>Windows</b> 自带的引导，所以我用 <b>Grub4DOS</b> 做了一个引导（这个可以粘贴在文件 <b>menu.lst</b> 最下面）：
</p>
<div class="org-src-container">

<pre class="src src-text">title  Arch Linux
root   (hd0,你实际的分区号)
kernel /boot/vmlinuz-linux root=/dev/sda3 ro
initrd /boot/initramfs-linux.img
</pre>
</div>
<p>
在复制这个的时候注意， <code>root (hd0,X)</code> 这里的 <code>X</code> 是你实际的分区号，就是当初将操作系统（引导）安装到来哪里的那个数字。
比如我是 <code>/dev/sda3</code> ，所以我这里的 <code>X</code> 就是 <code>3</code> 。切记!
</p>

<p>
<code>root=/dev/sda3</code> 这里是你安装操作系统主体的盘，因为我之前安装的时候偷懒，全部安装在一个盘上面，你们要是也懒的话可以学我。
我这里和上面的引导是同一个盘，所以还是 <code>3</code> 。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Beginners' guide</h2>
<div class="outline-text-2" id="text-3">
<p>
没错，接下来的步骤和官方指南一致啦。可以参考 <a href="https://wiki.archlinux.org/index.php/beginners'_guide">这里</a> 继续下面的步骤。当然也可以参考下面这些文章：
</p>
<ul class="org-ul">
<li><a href="http://blog.fooleap.org/hard-disk-installation-for-archlinux.html#id-section-1">硬盘安装 Arch Linux</a>
</li>
<li><a href="http://www.cnblogs.com/bl4nk/p/3299368.html">Windows7和Archlinux双系统硬盘安装笔记-Step 3</a>
</li>
<li><a href="http://blog.csdn.net/holdsky/article/details/8497764">archlinux （2012.12.01-dual） i686 硬盘安装</a>
</li>
<li><a href="https://lampjs.wordpress.com/2014/09/01/arch-linux-easy-install-with-with-windows-dual-boot-for-beginners/comment-page-1/">Arch Linux easy install with with windows (dual boot) for beginners</a>
</li>
</ul>

<p>
当然你也可以看看这些文章：
</p>
<ul class="org-ul">
<li><a href="https://wiki.archlinux.org/index.php/Dual_boot_with_Windows">Dual boot with Windows</a>
</li>
<li><a href="https://wiki.archlinux.org/index.php/Dual_boot_with_Windows/SafeBoot">Dual boot with Windows/SafeBoot</a>
</li>
<li><a href="https://wiki.archlinux.org/index.php/USB_flash_installation_media_(%25E7%25AE%2580%25E4%25BD%2593%25E4%25B8%25AD%25E6%2596%2587)">USB flash installation media (简体中文)</a>
</li>
<li><a href="http://www.kisa747.com/windows7-grub4dos.html">Windows 7上使用Grub4DOS</a>
</li>
</ul>

<p>
中间遇到的问题提一下： 
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> waiting for device</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<b>waiting for device</b> ，也就是著名的 <b>30s</b> 问题，解决的方法：
</p>
<div class="org-src-container">

<pre class="src src-sh">mkdir /tmpmnt
mount -r -t ntfs /dev/sda1 /tmpmnt
modprobe loop
losetup /dev/loop6 /tmpmnt/archlinux.iso
ln -s /dev/loop6 /dev/disk/by-label/archlinux
exit
</pre>
</div>

<ul class="org-ul">
<li>modprobe - add a Loadable Kernel Module and its dependencies to a running Linux system.
</li>
<li>loop - the Loopback module, which allows files to be mounted as filesystems, typically for creating boot disks.
</li>
<li>losetup - set up and control loop devices
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> wifi-menu</h3>
<div class="outline-text-3" id="text-3-2">
<p>
如果你在运行 <code>wifi-menu</code> 这个命令的时候出现了报错的情况，可以试试用下面的情况解决：
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo killall dhcpcd
$ sudo ip link set down # $ sudo ifconfig wlp3s0 down
$ sudo wifi-menu
</pre>
</div>

<p>
又如果，你运行 <code>wifi-menu</code> 这个命令，你得到了提示 <b>no dialog</b> 。我是这么解决的：
在安装系统的 <code>Live OS</code> 环境下，我先挂载系统盘，使用 <code>arch-chroot</code> 命令切换到相应的环境
</p>
<div class="org-src-container">

<pre class="src src-sh"># pacman -S iw wpa_supplicant dialog
</pre>
</div>
<p>
安装必要的组件。
</p>

<p>
如果你在安装了 <b>Desktop Envirnoment::Gnome 3</b> 还遇到了： <b>Please run NetworkManager</b> ，可以安装 <code>networkmanager</code> 试试，
具体的可以参考 <a href="https://wiki.archlinux.org/index.php/NetworkManager_(%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87)">这里(Offical wiki)</a>，或者 <a href="https://bbs.archlinux.org/viewtopic.php?id=116629">{SOLVED}{GNOME 3} After install - no Network Manager?</a>
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo pacman -S networkmanager
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> gnome-terminal</h3>
<div class="outline-text-3" id="text-3-3">
<p>
如果你在安装了 <b>Gnome 3</b> 之后，发现无法启动 <b>gnome-terminal</b> ，遇到了
</p>
<pre class="example">
(process:2410): Gtk-WARNING **: Locale not supported by C library.
	Using the fallback 'C' locale.
Error constructing proxy for org.gnome.Terminal:/org/gnome/Terminal/Factory0: Error calling StartServiceByName for org.gnome.Terminal: GDBus.Error:org.freedesktop.DBus.Error.Spawn.ChildExited: Process org.gnome.Terminal exited with status 1.
</pre>
<p>
或者
</p>
<pre class="example">
Error constructing proxy for org.gnome.Terminal:/org/gnome/Terminal/Factory0: Error calling StartServiceByName for org.gnome.Terminal: GDBus.Error:org.freedesktop.DBus.Error.Spawn.ChildExited: Process org.gnome.Terminal exited with status 1
</pre>

<p>
可以试试下面的方法：
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo vi /etc/locale.gen  # 去掉 en_US.UTF-8 和 zh_CN.UTF-8 注释
$ locale-gen
</pre>
</div>
<p>
然后，重启。
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> fcitx</h3>
<div class="outline-text-3" id="text-3-4">
<p>
安装拼音输入法，可以试试这个 <a href="https://wiki.archlinux.org/index.php/Fcitx_(%25E7%25AE%2580%25E4%25BD%2593%25E4%25B8%25AD%25E6%2596%2587)">Fcitx (简体中文)</a>
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo pacman -S fcitx fcitx-gtk2 fcitx-gtk3 fcitx-rime
</pre>
</div>
<p>
在 @akafeza 的提醒下，添加上一些配置 <b><b>~/.xprofile</b></b> （如果没有这个文件就创建一个，配置文件在 <b><b>/etc/gdm/Xsession</b></b> 被调用）
</p>
<div class="org-src-container">

<pre class="src src-text">export GTK_IM_MODULE=fcitx
export QT_IM_MODULE=fcitx
export XMODIFIERS=@im=fcitx
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Swap</h3>
<div class="outline-text-3" id="text-3-5">
<p>
交换分区/文件。因为笔者的计算机现在有8G RAM（开心脸）。不过还是纠结于要不要配置一个Swap。（安装的时候没有创建交换分区）
在无聊的摆弄Arch几天之后，我决定，给其配置一个Swap， <a href="https://wiki.archlinux.org/index.php/Swap_(%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87)">Swap Wiki</a> 。
</p>

<p>
在决定需要Swap之后，你会遇到一个问题，你需要多大的空间？
这个 <a href="http://askubuntu.com/a/49138">问题的答案</a> 会给你一定的启示。注意这个问题发表的时间：December 2012。
还有，建议你认真看一下上述那个问题采纳的答案。或许你会更加的有方向性 :P
顺便说一下，休眠(hibernation)需要这个Swap。
</p>

<p>
好了，提醒的就这么多，用到的命令罗列一下，如果你比较赶时间的话，直接看这里：
（我创建的是一个8G的交换文件，然后挂载）
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo fallocate -l 8192M /swapfile
$ sudo dd if=/dev/zero of=/swapfile bs=1M count=8192
$ sudo chmod 600 /swapfile
$ sudo mkswap /swapfile
$ sudo swapon /swapfile
$ sudo vi /etc/fstab
  # /swapfile none swap defaults 0 0
$ free -m # checking tool
$ swapon -s # watch the swap's status
</pre>
</div>

<ul class="org-ul">
<li>fallocate - preallocate or deallocate space to a file
</li>
</ul>

<p>
最后再罗嗦一下，经过几日的使用，发现交换文件始终没有被使用到。 <b><b>0</b></b>
而且，我也没有休眠的意愿。所以还是不需要Swap了吧。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Terminal</h2>
<div class="outline-text-2" id="text-4">
<p>
这么重要的东东，需要单独介绍！<a href="http://www.acgtyrant.com/">@暴君</a> 推荐这个组合：<br  />
<code>i3, termite, caiogondim/bullet-train-oh-my-zsh-theme</code> <br  />
出自：<a href="https://oao.moe/%E8%AE%BA%E9%A1%BA%E6%89%8B%E7%9A%84%E7%BB%88%E7%AB%AF%E6%A8%A1%E6%8B%9F%E5%99%A8/#comment-2594347643">Disqus</a>
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 尾声</h2>
<div class="outline-text-2" id="text-5">
<p>
等装完 <b>Arch</b> ，发现的确是一件很享受的事情。这篇文章只是记录我安装过程中遇到的一些问题和感想，不一定切合你的实际。
你可以继续阅读官方的 wiki 或者下面的文章：
</p>
<ul class="org-ul">
<li><a href="https://wiki.archlinux.org/index.php/beginners'_guide#Locale">Beginners' guide</a>
</li>
<li><a href="https://wiki.archlinux.org/index.php/GTK%252B_(%25E7%25AE%2580%25E4%25BD%2593%25E4%25B8%25AD%25E6%2596%2587)">GTK+ (简体中文)</a>
</li>
<li><a href="https://wiki.archlinux.org/index.php/chromium">Chromium</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="meta-article"><p class="author">冰糖火箭筒(Junjia Ni)</p>
<p class="email"><a href="mailto:creamidea(AT)gmail.com">creamidea(AT)gmail.com</a></p>
<p class="date">2016-03-22</p>
<p class="export-date">2016-04-07 Thu 16:58</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
<p class="last-modification-time">2016-04-07 Thu 16:00</p></div><script src="/static/app.js"></script><!-- Google Analytics --><script>window.ga=window.ga||function(){(ga.q=ga.q||[]).push(arguments)};ga.l=+new Date;ga('create', 'UA-38213594-1', 'auto');ga('send', 'pageview');</script><script async src='//www.google-analytics.com/analytics.js'></script><!-- End Google Analytics -->
</div>
</body>
</html>
